// 웹과 DOM
// DOM이란?
// Documnet Object Model
// HTML -> Javascrit로 도와주는 것

// 1. 웹의 구성요소
// 인터넷에서 사용자들이 공유할 수 있는 공간
// 웹페이지가 여러개 모여있는곳이 웹사이트다.
// 웹사이트는 HTML, JS, CSS로 이루어져있다.

// HTML: Hyper Text Markup Language - 웹 페이지의 요소들이 어떻게 구성되어있는 지 알려주는 역할
// Javscript: 웹 페이지를 동적으로 만들어 사용자와 상호작용을 가능하게 만드는 역할이다.
// CSS : 웹 페이지의 요소들을 꾸며주는 역할(색상, 크기 등)

// 돔과 트리
// 웹브라우저는 요소들의 상하 관계를 한눈에 볼 수 있도록 트리구조로 나타내고 이를 DOM트리라고 부른다.
image.pnga

// DOM은 자바스크립트가 접근하여 조작할 수 있도록 도와주는 구조이다.
// 태그 요소들은 각각 node라고 부르고, 하나의 객체 형태로 나타낸다.
// document - 노란색 문서요소
// 파란색 부분 - 요소, 속성들은 각각의 요소 노드에 연결된 속성이다.
// 분홍색 부분 - 텍스트 요소이다.
